Revit 2027 API
BuiltInFailures.AutoJoinFailures.DesignOptionCannotReference Property
 Design Option ' [Name] ' cannot reference Design Option ' [Name] '.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DesignOptionCannotReference { get; }
Public Shared ReadOnly Property DesignOptionCannotReference As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DesignOptionCannotReference {
	FailureDefinitionId^ get ();
}
static member DesignOptionCannotReference : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoJoinFailures Class
Autodesk.Revit.DB Namespace